esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
/*

    ESP8266 Multicast DNS (port of CC3000 Multicast DNS library)
    Version 1.1
    Copyright (c) 2013 Tony DiCola (tony@tonydicola.com)
    ESP8266 port (c) 2015 Ivan Grokhotkov (ivan@esp8266.com)
    MDNS-SD Suport 2015 Hristo Gochkov
    Extended MDNS-SD support 2016 Lars Englund (lars.englund@gmail.com)


    License (MIT license):
    Permission is hereby granted, free of charge, to any person obtaining a copy
    of this software and associated documentation files (the "Software"), to deal
    in the Software without restriction, including without limitation the rights
    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
    copies of the Software, and to permit persons to whom the Software is
    furnished to do so, subject to the following conditions:

    The above copyright notice and this permission notice shall be included in
    all copies or substantial portions of the Software.

    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
    THE SOFTWARE.

*/

// Important RFC's for reference:
// - DNS request and response: http://www.ietf.org/rfc/rfc1035.txt
// - Multicast DNS: http://www.ietf.org/rfc/rfc6762.txt
// - MDNS-SD: https://tools.ietf.org/html/rfc6763

#ifndef LWIP_OPEN_SRC
#define LWIP_OPEN_SRC
#endif

#include "ESP8266mDNS.h"
#include <functional>

#include "debug.h"

extern "C" {
#include "osapi.h"
#include "ets_sys.h"
#include "user_interface.h"
}

#include "WiFiUdp.h"
#include "lwip/opt.h"
#include "lwip/udp.h"
#include "lwip/inet.h"
#include "lwip/igmp.h"
#include "lwip/mem.h"
#include "include/UdpContext.h"



namespace Legacy_MDNSResponder
{


#ifdef DEBUG_ESP_MDNS
#define DEBUG_ESP_MDNS_ERR
#define DEBUG_ESP_MDNS_TX
#define DEBUG_ESP_MDNS_RX
#endif

#define MDNS_NAME_REF   0xC000

#define MDNS_TYPE_AAAA  0x001C
#define MDNS_TYPE_A     0x0001
#define MDNS_TYPE_PTR   0x000C
#define MDNS_TYPE_SRV   0x0021
#define MDNS_TYPE_TXT   0x0010

#define MDNS_CLASS_IN             0x0001
#define MDNS_CLASS_IN_FLUSH_CACHE 0x8001

#define MDNS_ANSWERS_ALL  0x0F
#define MDNS_ANSWER_PTR   0x08
#define MDNS_ANSWER_TXT   0x04
#define MDNS_ANSWER_SRV   0x02
#define MDNS_ANSWER_A     0x01

#define _conn_read32() (((uint32_t)_conn->read() << 24) | ((uint32_t)_conn->read() << 16) | ((uint32_t)_conn->read() << 8) | _conn->read())
#define _conn_read16() (((uint16_t)_conn->read() << 8) | _conn->read())
#define _conn_read8() _conn->read()
#define _conn_readS(b,l) _conn->read((char*)(b),l);

static const IPAddress MDNS_MULTICAST_ADDR(224, 0, 0, 251);
static const int MDNS_MULTICAST_TTL = 1;
static const int MDNS_PORT = 5353;

struct MDNSService
{
    MDNSService* _next;
    char _name[32];
    char _proto[4];
    uint16_t _port;
    uint16_t _txtLen; // length of all txts
    struct MDNSTxt * _txts;
};

struct MDNSTxt
{
    MDNSTxt * _next;
    String _txt;
};

struct MDNSAnswer
{
    MDNSAnswer* next;
    uint8_t ip[4];
    uint16_t port;
    char *hostname;
};

struct MDNSQuery
{
    char _service[32];
    char _proto[4];
};


MDNSResponder::MDNSResponder() : _conn(0)
{
    _services = 0;
    _instanceName = "";
    _answers = 0;
    _query = 0;
    _newQuery = false;
    _waitingForAnswers = false;
}
MDNSResponder::~MDNSResponder()
{
    if (_query != 0)
    {
        os_free(_query);
        _query = 0;
    }

    // Clear answer list
    MDNSAnswer *answer;
    int numAnswers = _getNumAnswers();
    for (int n = numAnswers - 1; n >= 0; n--)
    {
        answer = _getAnswerFromIdx(n);
        os_free(answer->hostname);
        os_free(answer);
        answer = 0;
    }
    _answers = 0;

    if (_conn)
        _conn->unref();
}

bool MDNSResponder::begin(const char* hostname)
{
    size_t n = strlen(hostname);
    if (n > 63)   // max size for a single label.
        return false;

    // Copy in hostname characters as lowercase
    _hostName = hostname;
    _hostName.toLowerCase();

    // If instance name is not already set copy hostname to instance name
    if (_instanceName.equals("")) _instanceName = hostname;

    _gotIPHandler = WiFi.onStationModeGotIP([this](const WiFiEventStationModeGotIP & event)
    {
        (void) event;
        _restart();
    });

    _disconnectedHandler = WiFi.onStationModeDisconnected([this](const WiFiEventStationModeDisconnected & event)
    {
        (void) event;
        _restart();
    });

    return _listen();
}

void MDNSResponder::notifyAPChange()
{
    _restart();
}

void MDNSResponder::_restart()
{
    if (_conn)
    {
        _conn->unref();
        _conn = nullptr;
    }
    _listen();
}

bool MDNSResponder::_listen()
{
    // Open the MDNS socket if it isn't already open.
    if (!_conn)
    {
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.println("MDNS listening");
#endif

        IPAddress mdns(MDNS_MULTICAST_ADDR);

        if (igmp_joingroup(IP4_ADDR_ANY4, mdns) != ERR_OK)
            return false;

        _conn = new UdpContext;
        _conn->ref();

        if (!_conn->listen(IP_ADDR_ANY, MDNS_PORT))
            return false;
        _conn->setMulticastTTL(MDNS_MULTICAST_TTL);
        _conn->onRx(std::bind(&MDNSResponder::update, this));
        _conn->connect(mdns, MDNS_PORT);
    }
    return true;
}

void MDNSResponder::update()
{
    if (!_conn || !_conn->next())
        return;
    _parsePacket();
}


void MDNSResponder::setInstanceName(String name)
{
    if (name.length() > 63)
        return;
    _instanceName = name;
}


bool MDNSResponder::addServiceTxt(char *name, char *proto, char *key, char *value)
{
    MDNSService* servicePtr;

    uint8_t txtLen = os_strlen(key) + os_strlen(value) + 1; // Add one for equals sign
    txtLen += 1; //accounts for length byte added when building the txt responce
    //Find the service
    for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next)
    {
        //Checking Service names
        if (strcmp(servicePtr->_name, name) == 0 && strcmp(servicePtr->_proto, proto) == 0)
        {
            //found a service name match
            if (servicePtr->_txtLen + txtLen > 1300)
                return false;  //max txt record size
            MDNSTxt *newtxt = new MDNSTxt;
            newtxt->_txt = String(key) + "=" + String(value);
            newtxt->_next = 0;
            if (servicePtr->_txts == 0)  //no services have been added
            {
                //Adding First TXT to service
                servicePtr->_txts = newtxt;
                servicePtr->_txtLen += txtLen;
                return true;
            }
            else
            {
                MDNSTxt * txtPtr = servicePtr->_txts;
                while (txtPtr->_next != 0)
                    txtPtr = txtPtr->_next;
                //adding another TXT to service
                txtPtr->_next = newtxt;
                servicePtr->_txtLen += txtLen;
                return true;
            }
        }
    }
    return false;
}

void MDNSResponder::addService(char *name, char *proto, uint16_t port)
{
    if (_getServicePort(name, proto) != 0)
        return;
    if (os_strlen(name) > 32 || os_strlen(proto) != 3)
        return; //bad arguments
    struct MDNSService *srv = (struct MDNSService*)(os_malloc(sizeof(struct MDNSService)));
    os_strcpy(srv->_name, name);
    os_strcpy(srv->_proto, proto);
    srv->_port = port;
    srv->_next = 0;
    srv->_txts = 0;
    srv->_txtLen = 0;

