esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
    if (_services == 0)
        _services = srv;
    else
    {
        MDNSService* servicePtr = _services;
        while (servicePtr->_next != 0)
            servicePtr = servicePtr->_next;
        servicePtr->_next = srv;
    }

}

int MDNSResponder::queryService(char *service, char *proto)
{
#ifdef DEBUG_ESP_MDNS_TX
    DEBUG_ESP_PORT.printf("queryService %s %s\n", service, proto);
#endif
    while (_answers != 0)
    {
        MDNSAnswer *currAnswer = _answers;
        _answers = _answers->next;
        os_free(currAnswer->hostname);
        os_free(currAnswer);
        currAnswer = 0;
    }
    if (_query != 0)
    {
        os_free(_query);
        _query = 0;
    }
    _query = (struct MDNSQuery*)(os_malloc(sizeof(struct MDNSQuery)));
    os_strcpy(_query->_service, service);
    os_strcpy(_query->_proto, proto);
    _newQuery = true;

    char underscore[] = "_";

    // build service name with _
    char serviceName[os_strlen(service) + 2];
    os_strcpy(serviceName, underscore);
    os_strcat(serviceName, service);
    size_t serviceNameLen = os_strlen(serviceName);

    //build proto name with _
    char protoName[5];
    os_strcpy(protoName, underscore);
    os_strcat(protoName, proto);
    size_t protoNameLen = 4;

    //local string
    char localName[] = "local";
    size_t localNameLen = 5;

    //terminator
    char terminator[] = "\0";

    // Only supports sending one PTR query
    uint8_t questionCount = 1;

    _waitingForAnswers = true;
    for (int itfn = 0; itfn < 2; itfn++)
    {
        struct ip_info ip_info;

        wifi_get_ip_info((!itfn) ? SOFTAP_IF : STATION_IF, &ip_info);
        if (!ip_info.ip.addr)
            continue;
        _conn->setMulticastInterface(IPAddress(ip_info.ip.addr));

        // Write the header
        _conn->flush();
        uint8_t head[12] =
        {
            0x00, 0x00, //ID = 0
            0x00, 0x00, //Flags = response + authoritative answer
            0x00, questionCount, //Question count
            0x00, 0x00, //Answer count
            0x00, 0x00, //Name server records
            0x00, 0x00 //Additional records
        };
        _conn->append(reinterpret_cast<const char*>(head), 12);

        // Only supports sending one PTR query
        // Send the Name field (eg. "_http._tcp.local")
        _conn->append(reinterpret_cast<const char*>(&serviceNameLen), 1);          // lenght of "_" + service
        _conn->append(reinterpret_cast<const char*>(serviceName), serviceNameLen); // "_" + service
        _conn->append(reinterpret_cast<const char*>(&protoNameLen), 1);            // lenght of "_" + proto
        _conn->append(reinterpret_cast<const char*>(protoName), protoNameLen);     // "_" + proto
        _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);            // lenght of "local"
        _conn->append(reinterpret_cast<const char*>(localName), localNameLen);     // "local"
        _conn->append(reinterpret_cast<const char*>(&terminator), 1);              // terminator

        //Send the type and class
        uint8_t ptrAttrs[4] =
        {
            0x00, 0x0c, //PTR record query
            0x00, 0x01 //Class IN
        };
        _conn->append(reinterpret_cast<const char*>(ptrAttrs), 4);
        _conn->send();
    }

#ifdef DEBUG_ESP_MDNS_TX
    DEBUG_ESP_PORT.println("Waiting for answers..");
#endif
    delay(1000);

    _waitingForAnswers = false;

    return _getNumAnswers();
}

String MDNSResponder::hostname(int idx)
{
    MDNSAnswer *answer = _getAnswerFromIdx(idx);
    if (answer == 0)
        return String();
    return answer->hostname;
}

IPAddress MDNSResponder::IP(int idx)
{
    MDNSAnswer *answer = _getAnswerFromIdx(idx);
    if (answer == 0)
        return IPAddress();
    return IPAddress(answer->ip);
}

uint16_t MDNSResponder::port(int idx)
{
    MDNSAnswer *answer = _getAnswerFromIdx(idx);
    if (answer == 0)
        return 0;
    return answer->port;
}

MDNSAnswer* MDNSResponder::_getAnswerFromIdx(int idx)
{
    MDNSAnswer *answer = _answers;
    while (answer != 0 && idx-- > 0)
        answer = answer->next;
    if (idx > 0)
        return 0;
    return answer;
}

int MDNSResponder::_getNumAnswers()
{
    int numAnswers = 0;
    MDNSAnswer *answer = _answers;
    while (answer != 0)
    {
        numAnswers++;
        answer = answer->next;
    }
    return numAnswers;
}

MDNSTxt * MDNSResponder::_getServiceTxt(char *name, char *proto)
{
    MDNSService* servicePtr;
    for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next)
    {
        if (servicePtr->_port > 0 && strcmp(servicePtr->_name, name) == 0 && strcmp(servicePtr->_proto, proto) == 0)
        {
            if (servicePtr->_txts == 0)
                return nullptr;
            return servicePtr->_txts;
        }
    }
    return nullptr;
}

uint16_t MDNSResponder::_getServiceTxtLen(char *name, char *proto)
{
    MDNSService* servicePtr;
    for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next)
    {
        if (servicePtr->_port > 0 && strcmp(servicePtr->_name, name) == 0 && strcmp(servicePtr->_proto, proto) == 0)
        {
            if (servicePtr->_txts == 0)
                return false;
            return servicePtr->_txtLen;
        }
    }
    return 0;
}

uint16_t MDNSResponder::_getServicePort(char *name, char *proto)
{
    MDNSService* servicePtr;
    for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next)
    {
        if (servicePtr->_port > 0 && strcmp(servicePtr->_name, name) == 0 && strcmp(servicePtr->_proto, proto) == 0)
            return servicePtr->_port;
    }
    return 0;
}

IPAddress MDNSResponder::_getRequestMulticastInterface()
{
    struct ip_info ip_info;
    bool match_ap = false;
    if (wifi_get_opmode() & SOFTAP_MODE)
    {
        const IPAddress& remote_ip = _conn->getRemoteAddress();
        wifi_get_ip_info(SOFTAP_IF, &ip_info);
        IPAddress infoIp(ip_info.ip);
        IPAddress infoMask(ip_info.netmask);
        if (ip_info.ip.addr && ip_addr_netcmp((const ip_addr_t*)remote_ip, (const ip_addr_t*)infoIp, ip_2_ip4((const ip_addr_t*)infoMask)))
            match_ap = true;
    }
    if (!match_ap)
        wifi_get_ip_info(STATION_IF, &ip_info);
    return IPAddress(ip_info.ip.addr);
}

void MDNSResponder::_parsePacket()
{
    int i;
    char tmp;
    bool serviceParsed = false;
    bool protoParsed = false;
    bool localParsed = false;

    char hostName[255];
    uint8_t hostNameLen;

    char serviceName[32];
    uint8_t serviceNameLen;
    uint16_t servicePort = 0;

    char protoName[32];
    protoName[0] = 0;
    uint8_t protoNameLen = 0;

    uint16_t packetHeader[6];

    for (i = 0; i < 6; i++)
        packetHeader[i] = _conn_read16();

    if ((packetHeader[1] & 0x8000) != 0)   // Read answers
    {
#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf("Reading answers RX: REQ, ID:%u, Q:%u, A:%u, NS:%u, ADD:%u\n", packetHeader[0], packetHeader[2], packetHeader[3], packetHeader[4], packetHeader[5]);
#endif

