esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
        if (!_waitingForAnswers)
        {
#ifdef DEBUG_ESP_MDNS_RX
            DEBUG_ESP_PORT.println("Not expecting any answers right now, returning");
#endif
            _conn->flush();
            return;
        }

        int numAnswers = packetHeader[3] + packetHeader[5];
        // Assume that the PTR answer always comes first and that it is always accompanied by a TXT, SRV, AAAA (optional) and A answer in the same packet.
        if (numAnswers < 4)
        {
#ifdef DEBUG_ESP_MDNS_RX
            DEBUG_ESP_PORT.printf("Expected a packet with 4 or more answers, got %u\n", numAnswers);
#endif
            _conn->flush();
            return;
        }

        uint8_t tmp8;
        uint16_t answerPort = 0;
        uint8_t answerIp[4] = { 0, 0, 0, 0 };
        char answerHostName[255];
        bool serviceMatch = false;
        MDNSAnswer *answer;
        uint8_t partsCollected = 0;
        uint8_t stringsRead = 0;

        answerHostName[0] = '\0';

        // Clear answer list
        if (_newQuery)
        {
            int oldAnswers = _getNumAnswers();
            for (int n = oldAnswers - 1; n >= 0; n--)
            {
                answer = _getAnswerFromIdx(n);
                os_free(answer->hostname);
                os_free(answer);
                answer = 0;
            }
            _answers = 0;
            _newQuery = false;
        }

        while (numAnswers--)
        {
            // Read name
            stringsRead = 0;
            size_t last_bufferpos = 0;
            do
            {
                tmp8 = _conn_read8();
                if (tmp8 == 0x00)   // End of name
                    break;
                if (tmp8 & 0xC0)   // Compressed pointer
                {
                    uint16_t offset = ((((uint16_t)tmp8) & ~0xC0) << 8) | _conn_read8();
                    if (_conn->isValidOffset(offset))
                    {
                        if (0 == last_bufferpos)
                            last_bufferpos  = _conn->tell();
#ifdef DEBUG_ESP_MDNS_RX
                        DEBUG_ESP_PORT.print("Compressed pointer, jumping from ");
                        DEBUG_ESP_PORT.print(last_bufferpos);
                        DEBUG_ESP_PORT.print(" to ");
                        DEBUG_ESP_PORT.println(offset);
#endif
                        _conn->seek(offset);
                        tmp8 = _conn_read8();
                    }
                    else
                    {
#ifdef DEBUG_ESP_MDNS_RX
                        DEBUG_ESP_PORT.print("Skipping malformed compressed pointer");
#endif
                        tmp8 = _conn_read8();
                        break;
                    }
                }
                if (stringsRead > 3)
                {
#ifdef DEBUG_ESP_MDNS_RX
                    DEBUG_ESP_PORT.println("failed to read the response name");
#endif
                    _conn->flush();
                    return;
                }
                _conn_readS(serviceName, tmp8);
                serviceName[tmp8] = '\0';
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.printf(" %d ", tmp8);
                for (int n = 0; n < tmp8; n++)
                    DEBUG_ESP_PORT.printf("%c", serviceName[n]);
                DEBUG_ESP_PORT.println();
#endif
                if (serviceName[0] == '_')
                {
                    if (strcmp(&serviceName[1], _query->_service) == 0)
                    {
                        serviceMatch = true;
#ifdef DEBUG_ESP_MDNS_RX
                        DEBUG_ESP_PORT.printf("found matching service: %s\n", _query->_service);
#endif
                    }
                }
                stringsRead++;
            } while (true);
            if (last_bufferpos > 0)
            {
                _conn->seek(last_bufferpos);
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.print("Compressed pointer, jumping back to ");
                DEBUG_ESP_PORT.println(last_bufferpos);
#endif
            }

            uint16_t answerType = _conn_read16(); // Read type
            uint16_t answerClass = _conn_read16(); // Read class
            uint32_t answerTtl = _conn_read32(); // Read ttl
            uint16_t answerRdlength = _conn_read16(); // Read rdlength

            (void) answerClass;
            (void) answerTtl;

            if (answerRdlength > 255)
            {
                if (answerType == MDNS_TYPE_TXT && answerRdlength < 1460)
                {
                    while (--answerRdlength) _conn->read();
                }
                else
                {
#ifdef DEBUG_ESP_MDNS_RX
                    DEBUG_ESP_PORT.printf("Data len too long! %u\n", answerRdlength);
#endif
                    _conn->flush();
                    return;
                }
            }

#ifdef DEBUG_ESP_MDNS_RX
            DEBUG_ESP_PORT.printf("type: %04x rdlength: %d\n", answerType, answerRdlength);
#endif

            if (answerType == MDNS_TYPE_PTR)
            {
                partsCollected |= 0x01;
                _conn_readS(hostName, answerRdlength); // Read rdata
                if (hostName[answerRdlength - 2] & 0xc0)
                {
                    memcpy(answerHostName, hostName + 1, answerRdlength - 3);
                    answerHostName[answerRdlength - 3] = '\0';
                }
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.printf("PTR %d ", answerRdlength);
                for (int n = 0; n < answerRdlength; n++)
                    DEBUG_ESP_PORT.printf("%c", hostName[n]);
                DEBUG_ESP_PORT.println();
#endif
            }

            else if (answerType == MDNS_TYPE_TXT)
            {
                partsCollected |= 0x02;
                _conn_readS(hostName, answerRdlength); // Read rdata
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.printf("TXT %d ", answerRdlength);
                for (int n = 0; n < answerRdlength; n++)
                    DEBUG_ESP_PORT.printf("%c", hostName[n]);
                DEBUG_ESP_PORT.println();
#endif
            }

            else if (answerType == MDNS_TYPE_SRV)
            {
                partsCollected |= 0x04;
                uint16_t answerPrio = _conn_read16(); // Read priority
                uint16_t answerWeight = _conn_read16(); // Read weight
                answerPort = _conn_read16(); // Read port
                last_bufferpos = 0;

                (void) answerPrio;
                (void) answerWeight;

                // Read hostname
                tmp8 = _conn_read8();
                if (tmp8 & 0xC0)   // Compressed pointer
                {
                    uint16_t offset = ((((uint16_t)tmp8) & ~0xC0) << 8) | _conn_read8();
                    if (_conn->isValidOffset(offset))
                    {
                        last_bufferpos = _conn->tell();
#ifdef DEBUG_ESP_MDNS_RX
                        DEBUG_ESP_PORT.print("Compressed pointer, jumping from ");
                        DEBUG_ESP_PORT.print(last_bufferpos);
                        DEBUG_ESP_PORT.print(" to ");
                        DEBUG_ESP_PORT.println(offset);
#endif
                        _conn->seek(offset);
                        tmp8 = _conn_read8();
                    }
                    else
                    {
#ifdef DEBUG_ESP_MDNS_RX
                        DEBUG_ESP_PORT.print("Skipping malformed compressed pointer");
#endif
                        tmp8 = _conn_read8();
                        break;
                    }
                }
                _conn_readS(answerHostName, tmp8);
                answerHostName[tmp8] = '\0';
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.printf("SRV %d ", tmp8);
                for (int n = 0; n < tmp8; n++)
                    DEBUG_ESP_PORT.printf("%02x ", answerHostName[n]);
                DEBUG_ESP_PORT.printf("\n%s\n", answerHostName);
#endif
                if (last_bufferpos > 0)
                {
                    _conn->seek(last_bufferpos);
                    tmp8 = 2; // Size of compression octets
#ifdef DEBUG_ESP_MDNS_RX
                    DEBUG_ESP_PORT.print("Compressed pointer, jumping back to ");
                    DEBUG_ESP_PORT.println(last_bufferpos);
#endif
                }
                if (answerRdlength - (6 + 1 + tmp8) > 0)   // Skip any remaining rdata
                    _conn_readS(hostName, answerRdlength - (6 + 1 + tmp8));
            }

