esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
            else if (answerType == MDNS_TYPE_A)
            {
                partsCollected |= 0x08;
                for (int i = 0; i < 4; i++)
                    answerIp[i] = _conn_read8();
            }
            else
            {
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.printf("Ignoring unsupported type %02x\n", tmp8);
#endif
                for (int n = 0; n < answerRdlength; n++)
                    (void)_conn_read8();
            }

            if ((partsCollected == 0x0F) && serviceMatch)
            {
#ifdef DEBUG_ESP_MDNS_RX
                DEBUG_ESP_PORT.println("All answers parsed, adding to _answers list..");
#endif
                // Add new answer to answer list
                if (_answers == 0)
                {
                    _answers = (struct MDNSAnswer*)(os_malloc(sizeof(struct MDNSAnswer)));
                    answer = _answers;
                }
                else
                {
                    answer = _answers;
                    while (answer->next != 0)
                        answer = answer->next;
                    answer->next = (struct MDNSAnswer*)(os_malloc(sizeof(struct MDNSAnswer)));
                    answer = answer->next;
                }
                answer->next = 0;
                answer->hostname = 0;

                // Populate new answer
                answer->port = answerPort;
                for (int i = 0; i < 4; i++)
                    answer->ip[i] = answerIp[i];
                answer->hostname = (char *)os_malloc(strlen(answerHostName) + 1);
                os_strcpy(answer->hostname, answerHostName);
                _conn->flush();
                return;
            }
        }

        _conn->flush();
        return;
    }

    // PARSE REQUEST NAME

    hostNameLen = _conn_read8() % 255;
    _conn_readS(hostName, hostNameLen);
    hostName[hostNameLen] = '\0';

    if (hostName[0] == '_')
    {
        serviceParsed = true;
        memcpy(serviceName, hostName + 1, hostNameLen);
        serviceNameLen = hostNameLen - 1;
        hostNameLen = 0;
    }

    if (hostNameLen > 0 && !_hostName.equals(hostName) && !_instanceName.equals(hostName))
    {
#ifdef DEBUG_ESP_MDNS_ERR
        DEBUG_ESP_PORT.printf("ERR_NO_HOST: %s\n", hostName);
        DEBUG_ESP_PORT.printf("hostname: %s\n", _hostName.c_str());
        DEBUG_ESP_PORT.printf("instance: %s\n", _instanceName.c_str());
#endif
        _conn->flush();
        return;
    }

    if (!serviceParsed)
    {
        serviceNameLen = _conn_read8() % 255;
        _conn_readS(serviceName, serviceNameLen);
        serviceName[serviceNameLen] = '\0';

        if (serviceName[0] == '_')
        {
            memmove(serviceName, serviceName + 1, serviceNameLen);
            serviceNameLen--;
            serviceParsed = true;
        }
        else if (serviceNameLen == 5 && strcmp("local", serviceName) == 0)
        {
            tmp = _conn_read8();
            if (tmp == 0)
            {
                serviceParsed = true;
                serviceNameLen = 0;
                protoParsed = true;
                protoNameLen = 0;
                localParsed = true;
            }
            else
            {
#ifdef DEBUG_ESP_MDNS_ERR
                DEBUG_ESP_PORT.printf("ERR_FQDN: %s\n", serviceName);
#endif
                _conn->flush();
                return;
            }
        }
        else
        {
#ifdef DEBUG_ESP_MDNS_ERR
            DEBUG_ESP_PORT.printf("ERR_SERVICE: %s\n", serviceName);
#endif
            _conn->flush();
            return;
        }
    }

    if (!protoParsed)
    {
        protoNameLen = _conn_read8() % 255;
        _conn_readS(protoName, protoNameLen);
        protoName[protoNameLen] = '\0';
        if (protoNameLen == 4 && protoName[0] == '_')
        {
            memmove(protoName, protoName + 1, protoNameLen);
            protoNameLen--;
            protoParsed = true;
        }
        else if (strcmp("services", serviceName) == 0 && strcmp("_dns-sd", protoName) == 0)
        {
            _conn->flush();
            IPAddress interface = _getRequestMulticastInterface();
            _replyToTypeEnumRequest(interface);
            return;
        }
        else
        {
#ifdef DEBUG_ESP_MDNS_ERR
            DEBUG_ESP_PORT.printf("ERR_PROTO: %s\n", protoName);
#endif
            _conn->flush();
            return;
        }
    }

    if (!localParsed)
    {
        char localName[32];
        uint8_t localNameLen = _conn_read8() % 31;
        _conn_readS(localName, localNameLen);
        localName[localNameLen] = '\0';
        tmp = _conn_read8();
        if (localNameLen == 5 && strcmp("local", localName) == 0 && tmp == 0)
            localParsed = true;
        else
        {
#ifdef DEBUG_ESP_MDNS_ERR
            DEBUG_ESP_PORT.printf("ERR_FQDN: %s\n", localName);
#endif
            _conn->flush();
            return;
        }
    }

    if (serviceNameLen > 0 && protoNameLen > 0)
    {
        servicePort = _getServicePort(serviceName, protoName);
        if (servicePort == 0)
        {
#ifdef DEBUG_ESP_MDNS_ERR
            DEBUG_ESP_PORT.printf("ERR_NO_SERVICE: %s\n", serviceName);
#endif
            _conn->flush();
            return;
        }
    }
    else if (serviceNameLen > 0 || protoNameLen > 0)
    {
#ifdef DEBUG_ESP_MDNS_ERR
        DEBUG_ESP_PORT.printf("ERR_SERVICE_PROTO: %s\n", serviceName);
#endif
        _conn->flush();
        return;
    }

    // RESPOND

#ifdef DEBUG_ESP_MDNS_RX
    DEBUG_ESP_PORT.printf("RX: REQ, ID:%u, Q:%u, A:%u, NS:%u, ADD:%u\n", packetHeader[0], packetHeader[2], packetHeader[3], packetHeader[4], packetHeader[5]);
#endif

    uint16_t currentType;
    uint16_t currentClass;

    int numQuestions = packetHeader[2];
    if (numQuestions > 4) numQuestions = 4;
    uint16_t questions[4];
    int question = 0;

    while (numQuestions--)
    {
        currentType = _conn_read16();
        if (currentType & MDNS_NAME_REF) //new header handle it better!
            currentType = _conn_read16();
        currentClass = _conn_read16();
        if (currentClass & MDNS_CLASS_IN) questions[question++] = currentType;

