esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
        if (numQuestions > 0)
        {
            if (_conn_read16() != 0xC00C) //new question but for another host/service
            {
                _conn->flush();
                numQuestions = 0;
            }
        }

#ifdef DEBUG_ESP_MDNS_RX
        DEBUG_ESP_PORT.printf("REQ: ");
        if (hostNameLen > 0)
            DEBUG_ESP_PORT.printf("%s.", hostName);
        if (serviceNameLen > 0)
            DEBUG_ESP_PORT.printf("_%s.", serviceName);
        if (protoNameLen > 0)
            DEBUG_ESP_PORT.printf("_%s.", protoName);
        DEBUG_ESP_PORT.printf("local. ");

        if (currentType == MDNS_TYPE_AAAA)
            DEBUG_ESP_PORT.printf("  AAAA ");
        else if (currentType == MDNS_TYPE_A)
            DEBUG_ESP_PORT.printf("  A ");
        else if (currentType == MDNS_TYPE_PTR)
            DEBUG_ESP_PORT.printf("  PTR ");
        else if (currentType == MDNS_TYPE_SRV)
            DEBUG_ESP_PORT.printf("  SRV ");
        else if (currentType == MDNS_TYPE_TXT)
            DEBUG_ESP_PORT.printf("  TXT ");
        else
            DEBUG_ESP_PORT.printf("  0x%04X ", currentType);

        if (currentClass == MDNS_CLASS_IN)
            DEBUG_ESP_PORT.printf("  IN ");
        else if (currentClass == MDNS_CLASS_IN_FLUSH_CACHE)
            DEBUG_ESP_PORT.printf("  IN[F] ");
        else
            DEBUG_ESP_PORT.printf("  0x%04X ", currentClass);

        DEBUG_ESP_PORT.printf("\n");
#endif
    }
    uint8_t questionMask = 0;
    uint8_t responseMask = 0;
    for (i = 0; i < question; i++)
    {
        if (questions[i] == MDNS_TYPE_A)
        {
            questionMask |= 0x1;
            responseMask |= 0x1;
        }
        else if (questions[i] == MDNS_TYPE_SRV)
        {
            questionMask |= 0x2;
            responseMask |= 0x3;
        }
        else if (questions[i] == MDNS_TYPE_TXT)
        {
            questionMask |= 0x4;
            responseMask |= 0x4;
        }
        else if (questions[i] == MDNS_TYPE_PTR)
        {
            questionMask |= 0x8;
            responseMask |= 0xF;
        }
    }

    IPAddress interface = _getRequestMulticastInterface();
    return _replyToInstanceRequest(questionMask, responseMask, serviceName, protoName, servicePort, interface);
}


/**
    STRINGIZE
*/
#ifndef STRINGIZE
#define STRINGIZE(x) #x
#endif
#ifndef STRINGIZE_VALUE_OF
#define STRINGIZE_VALUE_OF(x) STRINGIZE(x)
#endif


void MDNSResponder::enableArduino(uint16_t port, bool auth)
{

    addService("arduino", "tcp", port);
    addServiceTxt("arduino", "tcp", "tcp_check", "no");
    addServiceTxt("arduino", "tcp", "ssh_upload", "no");
    addServiceTxt("arduino", "tcp", "board", STRINGIZE_VALUE_OF(ARDUINO_BOARD));
    addServiceTxt("arduino", "tcp", "auth_upload", (auth) ? "yes" : "no");
}

void MDNSResponder::_replyToTypeEnumRequest(IPAddress multicastInterface)
{
    MDNSService* servicePtr;
    for (servicePtr = _services; servicePtr; servicePtr = servicePtr->_next)
    {
        if (servicePtr->_port > 0)
        {
            char *service = servicePtr->_name;
            char *proto = servicePtr->_proto;
            //uint16_t port = servicePtr->_port;

#ifdef DEBUG_ESP_MDNS_TX
            DEBUG_ESP_PORT.printf("TX: service:%s, proto:%s\n", service, proto);
#endif

            char sdHostName[] = "_services";
            size_t sdHostNameLen = 9;
            char sdServiceName[] = "_dns-sd";
            size_t sdServiceNameLen = 7;
            char sdProtoName[] = "_udp";
            size_t sdProtoNameLen = 4;

            char underscore[]  = "_";

            // build service name with _
            char serviceName[os_strlen(service) + 2];
            os_strcpy(serviceName, underscore);
            os_strcat(serviceName, service);
            size_t serviceNameLen = os_strlen(serviceName);

            //build proto name with _
            char protoName[5];
            os_strcpy(protoName, underscore);
            os_strcat(protoName, proto);
            size_t protoNameLen = 4;

            //local string
            char localName[] = "local";
            size_t localNameLen = 5;

            //terminator
            char terminator[] = "\0";

            //Write the header
            _conn->flush();
            uint8_t head[12] =
            {
                0x00, 0x00, //ID = 0
                0x84, 0x00, //Flags = response + authoritative answer
                0x00, 0x00, //Question count
                0x00, 0x01, //Answer count
                0x00, 0x00, //Name server records
                0x00, 0x00, //Additional records
            };
            _conn->append(reinterpret_cast<const char*>(head), 12);

            // Send the Name field (ie. "_services._dns-sd._udp.local")
            _conn->append(reinterpret_cast<const char*>(&sdHostNameLen), 1);         // length of "_services"
            _conn->append(reinterpret_cast<const char*>(sdHostName), sdHostNameLen); // "_services"
            _conn->append(reinterpret_cast<const char*>(&sdServiceNameLen), 1);      // length of "_dns-sd"
            _conn->append(reinterpret_cast<const char*>(sdServiceName), sdServiceNameLen);// "_dns-sd"
            _conn->append(reinterpret_cast<const char*>(&sdProtoNameLen), 1);        // length of "_udp"
            _conn->append(reinterpret_cast<const char*>(sdProtoName), sdProtoNameLen); // "_udp"
            _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
            _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
            _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

            //Send the type, class, ttl and rdata length
            uint8_t ptrDataLen = serviceNameLen + protoNameLen + localNameLen + 4;   // 4 is three label sizes and the terminator
            uint8_t ptrAttrs[10] =
            {
                0x00, 0x0c,             //PTR record query
                0x00, 0x01,             //Class IN
                0x00, 0x00, 0x11, 0x94, //TTL 4500
                0x00, ptrDataLen,       //RData length
            };
            _conn->append(reinterpret_cast<const char*>(ptrAttrs), 10);

