esp8266/Arduino/libraries/ESP8266mDNS/src/ESP8266mDNS_Legacy.cpp
        }

        // A Response
        if ((responseSection == 0 ? answerMask : additionalMask) & 0x1)
        {
            //Send the RData (ie. "esp8266.local")
            _conn->append(reinterpret_cast<const char*>(&hostNameLen), 1);           // length of "esp8266"
            _conn->append(reinterpret_cast<const char*>(hostName.c_str()), hostNameLen);// "esp8266"
            _conn->append(reinterpret_cast<const char*>(&localNameLen), 1);          // length "local"
            _conn->append(reinterpret_cast<const char*>(localName), localNameLen);   // "local"
            _conn->append(reinterpret_cast<const char*>(&terminator), 1);            // terminator

            uint8_t aaaAttrs[10] =
            {
                0x00, 0x01,             //TYPE A
                0x80, 0x01,             //Class IN, with cache flush
                0x00, 0x00, 0x00, 0x78, //TTL 120
                0x00, 0x04,             //DATA LEN
            };
            _conn->append(reinterpret_cast<const char*>(aaaAttrs), 10);

            // Send RData
            uint32_t ip = multicastInterface;
            uint8_t aaaRData[4] =
            {
                (uint8_t)(ip & 0xFF),         //IP first octet
                (uint8_t)((ip >> 8) & 0xFF),  //IP second octet
                (uint8_t)((ip >> 16) & 0xFF), //IP third octet
                (uint8_t)((ip >> 24) & 0xFF)  //IP fourth octet
            };
            _conn->append(reinterpret_cast<const char*>(aaaRData), 4);
        }
    }

    _conn->setMulticastInterface(multicastInterface);
    _conn->send();
}

#if !defined(NO_GLOBAL_INSTANCES) && !defined(NO_GLOBAL_MDNS)
MDNSResponder MDNS;
#endif

}	// namespace Legacy_MDNSResponder




